Revit 2027 API
IFCExtrusionData.IsValid Method
 Determines if the extrusion data represents a valid extrusion.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if the extrusion is valid, false otherwise.
See Also
Reference
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace